package AdditionalTasks;

/**
 *  Задание 2.
 *    За каждый месяц банк начисляет к сумме вклада 7% от суммы.
 *    Напишите программу, в которую пользователь вводит сумму вклада и количество месяцев.
 *    А банк вычисляет конечную сумму вклада с учетом начисления процентов за каждый месяц.
 *    Для вычисления суммы с учетом процентов используйте цикл for.
 *    Пусть сумма вклада будет представлять тип float.
 */

public class Main2 {

    public static void main(String[] args) {
        Task2 t2 = new Task2();
        t2.taskAT2();
    }
}
