package Cycles;

/**
 *  Задание 2.
 * 	  Необходимо вывести на экран числа от 5 до 1.
 * 	  При решении используйте операцию декремента (--).
 */

public class Task2 {

    public void taskC2() {
        for (byte i = 5; i > 0; i--) {
            System.out.println(i);
        }
        System.out.println("Пристегнитесь мы взлетаем!");
    }
}
